Microchip-MPLAB-Harmony/ethercat/apps/ethercat_counter_foe_app/firmware/src/packs/ATSAME53J20A_DFP/component/i2s.h
/* -------- I2S_TXCTRL : (I2S Offset: 0x20) (R/W 32) Tx Serializer Control -------- */
#define I2S_TXCTRL_RESETVALUE                 _U_(0x00)                                            /**<  (I2S_TXCTRL) Tx Serializer Control  Reset Value */

#define I2S_TXCTRL_TXDEFAULT_Pos              _U_(2)                                               /**< (I2S_TXCTRL) Line Default Line when Slot Disabled Position */
#define I2S_TXCTRL_TXDEFAULT_Msk              (_U_(0x3) << I2S_TXCTRL_TXDEFAULT_Pos)               /**< (I2S_TXCTRL) Line Default Line when Slot Disabled Mask */
#define I2S_TXCTRL_TXDEFAULT(value)           (I2S_TXCTRL_TXDEFAULT_Msk & ((value) << I2S_TXCTRL_TXDEFAULT_Pos))
#define   I2S_TXCTRL_TXDEFAULT_ZERO_Val       _U_(0x0)                                             /**< (I2S_TXCTRL) Output Default Value is 0  */
#define   I2S_TXCTRL_TXDEFAULT_ONE_Val        _U_(0x1)                                             /**< (I2S_TXCTRL) Output Default Value is 1  */
#define   I2S_TXCTRL_TXDEFAULT_HIZ_Val        _U_(0x3)                                             /**< (I2S_TXCTRL) Output Default Value is high impedance  */
#define I2S_TXCTRL_TXDEFAULT_ZERO             (I2S_TXCTRL_TXDEFAULT_ZERO_Val << I2S_TXCTRL_TXDEFAULT_Pos) /**< (I2S_TXCTRL) Output Default Value is 0 Position  */
#define I2S_TXCTRL_TXDEFAULT_ONE              (I2S_TXCTRL_TXDEFAULT_ONE_Val << I2S_TXCTRL_TXDEFAULT_Pos) /**< (I2S_TXCTRL) Output Default Value is 1 Position  */
#define I2S_TXCTRL_TXDEFAULT_HIZ              (I2S_TXCTRL_TXDEFAULT_HIZ_Val << I2S_TXCTRL_TXDEFAULT_Pos) /**< (I2S_TXCTRL) Output Default Value is high impedance Position  */
#define I2S_TXCTRL_TXSAME_Pos                 _U_(4)                                               /**< (I2S_TXCTRL) Transmit Data when Underrun Position */
#define I2S_TXCTRL_TXSAME_Msk                 (_U_(0x1) << I2S_TXCTRL_TXSAME_Pos)                  /**< (I2S_TXCTRL) Transmit Data when Underrun Mask */
#define I2S_TXCTRL_TXSAME(value)              (I2S_TXCTRL_TXSAME_Msk & ((value) << I2S_TXCTRL_TXSAME_Pos))
#define   I2S_TXCTRL_TXSAME_ZERO_Val          _U_(0x0)                                             /**< (I2S_TXCTRL) Zero data transmitted in case of underrun  */
#define   I2S_TXCTRL_TXSAME_SAME_Val          _U_(0x1)                                             /**< (I2S_TXCTRL) Last data transmitted in case of underrun  */
#define I2S_TXCTRL_TXSAME_ZERO                (I2S_TXCTRL_TXSAME_ZERO_Val << I2S_TXCTRL_TXSAME_Pos) /**< (I2S_TXCTRL) Zero data transmitted in case of underrun Position  */
#define I2S_TXCTRL_TXSAME_SAME                (I2S_TXCTRL_TXSAME_SAME_Val << I2S_TXCTRL_TXSAME_Pos) /**< (I2S_TXCTRL) Last data transmitted in case of underrun Position  */
#define I2S_TXCTRL_SLOTADJ_Pos                _U_(7)                                               /**< (I2S_TXCTRL) Data Slot Formatting Adjust Position */
#define I2S_TXCTRL_SLOTADJ_Msk                (_U_(0x1) << I2S_TXCTRL_SLOTADJ_Pos)                 /**< (I2S_TXCTRL) Data Slot Formatting Adjust Mask */
#define I2S_TXCTRL_SLOTADJ(value)             (I2S_TXCTRL_SLOTADJ_Msk & ((value) << I2S_TXCTRL_SLOTADJ_Pos))
#define   I2S_TXCTRL_SLOTADJ_RIGHT_Val        _U_(0x0)                                             /**< (I2S_TXCTRL) Data is right adjusted in slot  */
#define   I2S_TXCTRL_SLOTADJ_LEFT_Val         _U_(0x1)                                             /**< (I2S_TXCTRL) Data is left adjusted in slot  */
#define I2S_TXCTRL_SLOTADJ_RIGHT              (I2S_TXCTRL_SLOTADJ_RIGHT_Val << I2S_TXCTRL_SLOTADJ_Pos) /**< (I2S_TXCTRL) Data is right adjusted in slot Position  */
#define I2S_TXCTRL_SLOTADJ_LEFT               (I2S_TXCTRL_SLOTADJ_LEFT_Val << I2S_TXCTRL_SLOTADJ_Pos) /**< (I2S_TXCTRL) Data is left adjusted in slot Position  */
#define I2S_TXCTRL_DATASIZE_Pos               _U_(8)                                               /**< (I2S_TXCTRL) Data Word Size Position */
#define I2S_TXCTRL_DATASIZE_Msk               (_U_(0x7) << I2S_TXCTRL_DATASIZE_Pos)                /**< (I2S_TXCTRL) Data Word Size Mask */
#define I2S_TXCTRL_DATASIZE(value)            (I2S_TXCTRL_DATASIZE_Msk & ((value) << I2S_TXCTRL_DATASIZE_Pos))
#define   I2S_TXCTRL_DATASIZE_32_Val          _U_(0x0)                                             /**< (I2S_TXCTRL) 32 bits  */
#define   I2S_TXCTRL_DATASIZE_24_Val          _U_(0x1)                                             /**< (I2S_TXCTRL) 24 bits  */
#define   I2S_TXCTRL_DATASIZE_20_Val          _U_(0x2)                                             /**< (I2S_TXCTRL) 20 bits  */
#define   I2S_TXCTRL_DATASIZE_18_Val          _U_(0x3)                                             /**< (I2S_TXCTRL) 18 bits  */
#define   I2S_TXCTRL_DATASIZE_16_Val          _U_(0x4)                                             /**< (I2S_TXCTRL) 16 bits  */
#define   I2S_TXCTRL_DATASIZE_16C_Val         _U_(0x5)                                             /**< (I2S_TXCTRL) 16 bits compact stereo  */
#define   I2S_TXCTRL_DATASIZE_8_Val           _U_(0x6)                                             /**< (I2S_TXCTRL) 8 bits  */
#define   I2S_TXCTRL_DATASIZE_8C_Val          _U_(0x7)                                             /**< (I2S_TXCTRL) 8 bits compact stereo  */
#define I2S_TXCTRL_DATASIZE_32                (I2S_TXCTRL_DATASIZE_32_Val << I2S_TXCTRL_DATASIZE_Pos) /**< (I2S_TXCTRL) 32 bits Position  */
#define I2S_TXCTRL_DATASIZE_24                (I2S_TXCTRL_DATASIZE_24_Val << I2S_TXCTRL_DATASIZE_Pos) /**< (I2S_TXCTRL) 24 bits Position  */
#define I2S_TXCTRL_DATASIZE_20                (I2S_TXCTRL_DATASIZE_20_Val << I2S_TXCTRL_DATASIZE_Pos) /**< (I2S_TXCTRL) 20 bits Position  */
#define I2S_TXCTRL_DATASIZE_18                (I2S_TXCTRL_DATASIZE_18_Val << I2S_TXCTRL_DATASIZE_Pos) /**< (I2S_TXCTRL) 18 bits Position  */
#define I2S_TXCTRL_DATASIZE_16                (I2S_TXCTRL_DATASIZE_16_Val << I2S_TXCTRL_DATASIZE_Pos) /**< (I2S_TXCTRL) 16 bits Position  */
#define I2S_TXCTRL_DATASIZE_16C               (I2S_TXCTRL_DATASIZE_16C_Val << I2S_TXCTRL_DATASIZE_Pos) /**< (I2S_TXCTRL) 16 bits compact stereo Position  */
#define I2S_TXCTRL_DATASIZE_8                 (I2S_TXCTRL_DATASIZE_8_Val << I2S_TXCTRL_DATASIZE_Pos) /**< (I2S_TXCTRL) 8 bits Position  */
#define I2S_TXCTRL_DATASIZE_8C                (I2S_TXCTRL_DATASIZE_8C_Val << I2S_TXCTRL_DATASIZE_Pos) /**< (I2S_TXCTRL) 8 bits compact stereo Position  */
#define I2S_TXCTRL_WORDADJ_Pos                _U_(12)                                              /**< (I2S_TXCTRL) Data Word Formatting Adjust Position */
#define I2S_TXCTRL_WORDADJ_Msk                (_U_(0x1) << I2S_TXCTRL_WORDADJ_Pos)                 /**< (I2S_TXCTRL) Data Word Formatting Adjust Mask */
#define I2S_TXCTRL_WORDADJ(value)             (I2S_TXCTRL_WORDADJ_Msk & ((value) << I2S_TXCTRL_WORDADJ_Pos))
#define   I2S_TXCTRL_WORDADJ_RIGHT_Val        _U_(0x0)                                             /**< (I2S_TXCTRL) Data is right adjusted in word  */
#define   I2S_TXCTRL_WORDADJ_LEFT_Val         _U_(0x1)                                             /**< (I2S_TXCTRL) Data is left adjusted in word  */
#define I2S_TXCTRL_WORDADJ_RIGHT              (I2S_TXCTRL_WORDADJ_RIGHT_Val << I2S_TXCTRL_WORDADJ_Pos) /**< (I2S_TXCTRL) Data is right adjusted in word Position  */
#define I2S_TXCTRL_WORDADJ_LEFT               (I2S_TXCTRL_WORDADJ_LEFT_Val << I2S_TXCTRL_WORDADJ_Pos) /**< (I2S_TXCTRL) Data is left adjusted in word Position  */
#define I2S_TXCTRL_EXTEND_Pos                 _U_(13)                                              /**< (I2S_TXCTRL) Data Formatting Bit Extension Position */
#define I2S_TXCTRL_EXTEND_Msk                 (_U_(0x3) << I2S_TXCTRL_EXTEND_Pos)                  /**< (I2S_TXCTRL) Data Formatting Bit Extension Mask */
#define I2S_TXCTRL_EXTEND(value)              (I2S_TXCTRL_EXTEND_Msk & ((value) << I2S_TXCTRL_EXTEND_Pos))
#define   I2S_TXCTRL_EXTEND_ZERO_Val          _U_(0x0)                                             /**< (I2S_TXCTRL) Extend with zeroes  */
#define   I2S_TXCTRL_EXTEND_ONE_Val           _U_(0x1)                                             /**< (I2S_TXCTRL) Extend with ones  */
#define   I2S_TXCTRL_EXTEND_MSBIT_Val         _U_(0x2)                                             /**< (I2S_TXCTRL) Extend with Most Significant Bit  */
#define   I2S_TXCTRL_EXTEND_LSBIT_Val         _U_(0x3)                                             /**< (I2S_TXCTRL) Extend with Least Significant Bit  */
#define I2S_TXCTRL_EXTEND_ZERO                (I2S_TXCTRL_EXTEND_ZERO_Val << I2S_TXCTRL_EXTEND_Pos) /**< (I2S_TXCTRL) Extend with zeroes Position  */
#define I2S_TXCTRL_EXTEND_ONE                 (I2S_TXCTRL_EXTEND_ONE_Val << I2S_TXCTRL_EXTEND_Pos) /**< (I2S_TXCTRL) Extend with ones Position  */
#define I2S_TXCTRL_EXTEND_MSBIT               (I2S_TXCTRL_EXTEND_MSBIT_Val << I2S_TXCTRL_EXTEND_Pos) /**< (I2S_TXCTRL) Extend with Most Significant Bit Position  */
#define I2S_TXCTRL_EXTEND_LSBIT               (I2S_TXCTRL_EXTEND_LSBIT_Val << I2S_TXCTRL_EXTEND_Pos) /**< (I2S_TXCTRL) Extend with Least Significant Bit Position  */
#define I2S_TXCTRL_BITREV_Pos                 _U_(15)                                              /**< (I2S_TXCTRL) Data Formatting Bit Reverse Position */
#define I2S_TXCTRL_BITREV_Msk                 (_U_(0x1) << I2S_TXCTRL_BITREV_Pos)                  /**< (I2S_TXCTRL) Data Formatting Bit Reverse Mask */
#define I2S_TXCTRL_BITREV(value)              (I2S_TXCTRL_BITREV_Msk & ((value) << I2S_TXCTRL_BITREV_Pos))
#define   I2S_TXCTRL_BITREV_MSBIT_Val         _U_(0x0)                                             /**< (I2S_TXCTRL) Transfer Data Most Significant Bit (MSB) first (default for I2S protocol)  */
#define   I2S_TXCTRL_BITREV_LSBIT_Val         _U_(0x1)                                             /**< (I2S_TXCTRL) Transfer Data Least Significant Bit (LSB) first  */
#define I2S_TXCTRL_BITREV_MSBIT               (I2S_TXCTRL_BITREV_MSBIT_Val << I2S_TXCTRL_BITREV_Pos) /**< (I2S_TXCTRL) Transfer Data Most Significant Bit (MSB) first (default for I2S protocol) Position  */
#define I2S_TXCTRL_BITREV_LSBIT               (I2S_TXCTRL_BITREV_LSBIT_Val << I2S_TXCTRL_BITREV_Pos) /**< (I2S_TXCTRL) Transfer Data Least Significant Bit (LSB) first Position  */
#define I2S_TXCTRL_SLOTDIS0_Pos               _U_(16)                                              /**< (I2S_TXCTRL) Slot 0 Disabled for this Serializer Position */
#define I2S_TXCTRL_SLOTDIS0_Msk               (_U_(0x1) << I2S_TXCTRL_SLOTDIS0_Pos)                /**< (I2S_TXCTRL) Slot 0 Disabled for this Serializer Mask */
#define I2S_TXCTRL_SLOTDIS0(value)            (I2S_TXCTRL_SLOTDIS0_Msk & ((value) << I2S_TXCTRL_SLOTDIS0_Pos))
#define I2S_TXCTRL_SLOTDIS1_Pos               _U_(17)                                              /**< (I2S_TXCTRL) Slot 1 Disabled for this Serializer Position */
#define I2S_TXCTRL_SLOTDIS1_Msk               (_U_(0x1) << I2S_TXCTRL_SLOTDIS1_Pos)                /**< (I2S_TXCTRL) Slot 1 Disabled for this Serializer Mask */
#define I2S_TXCTRL_SLOTDIS1(value)            (I2S_TXCTRL_SLOTDIS1_Msk & ((value) << I2S_TXCTRL_SLOTDIS1_Pos))
#define I2S_TXCTRL_SLOTDIS2_Pos               _U_(18)                                              /**< (I2S_TXCTRL) Slot 2 Disabled for this Serializer Position */
#define I2S_TXCTRL_SLOTDIS2_Msk               (_U_(0x1) << I2S_TXCTRL_SLOTDIS2_Pos)                /**< (I2S_TXCTRL) Slot 2 Disabled for this Serializer Mask */
#define I2S_TXCTRL_SLOTDIS2(value)            (I2S_TXCTRL_SLOTDIS2_Msk & ((value) << I2S_TXCTRL_SLOTDIS2_Pos))
#define I2S_TXCTRL_SLOTDIS3_Pos               _U_(19)                                              /**< (I2S_TXCTRL) Slot 3 Disabled for this Serializer Position */
#define I2S_TXCTRL_SLOTDIS3_Msk               (_U_(0x1) << I2S_TXCTRL_SLOTDIS3_Pos)                /**< (I2S_TXCTRL) Slot 3 Disabled for this Serializer Mask */
#define I2S_TXCTRL_SLOTDIS3(value)            (I2S_TXCTRL_SLOTDIS3_Msk & ((value) << I2S_TXCTRL_SLOTDIS3_Pos))
#define I2S_TXCTRL_SLOTDIS4_Pos               _U_(20)                                              /**< (I2S_TXCTRL) Slot 4 Disabled for this Serializer Position */
#define I2S_TXCTRL_SLOTDIS4_Msk               (_U_(0x1) << I2S_TXCTRL_SLOTDIS4_Pos)                /**< (I2S_TXCTRL) Slot 4 Disabled for this Serializer Mask */
#define I2S_TXCTRL_SLOTDIS4(value)            (I2S_TXCTRL_SLOTDIS4_Msk & ((value) << I2S_TXCTRL_SLOTDIS4_Pos))
#define I2S_TXCTRL_SLOTDIS5_Pos               _U_(21)                                              /**< (I2S_TXCTRL) Slot 5 Disabled for this Serializer Position */
#define I2S_TXCTRL_SLOTDIS5_Msk               (_U_(0x1) << I2S_TXCTRL_SLOTDIS5_Pos)                /**< (I2S_TXCTRL) Slot 5 Disabled for this Serializer Mask */
#define I2S_TXCTRL_SLOTDIS5(value)            (I2S_TXCTRL_SLOTDIS5_Msk & ((value) << I2S_TXCTRL_SLOTDIS5_Pos))
#define I2S_TXCTRL_SLOTDIS6_Pos               _U_(22)                                              /**< (I2S_TXCTRL) Slot 6 Disabled for this Serializer Position */
#define I2S_TXCTRL_SLOTDIS6_Msk               (_U_(0x1) << I2S_TXCTRL_SLOTDIS6_Pos)                /**< (I2S_TXCTRL) Slot 6 Disabled for this Serializer Mask */
#define I2S_TXCTRL_SLOTDIS6(value)            (I2S_TXCTRL_SLOTDIS6_Msk & ((value) << I2S_TXCTRL_SLOTDIS6_Pos))
#define I2S_TXCTRL_SLOTDIS7_Pos               _U_(23)                                              /**< (I2S_TXCTRL) Slot 7 Disabled for this Serializer Position */
#define I2S_TXCTRL_SLOTDIS7_Msk               (_U_(0x1) << I2S_TXCTRL_SLOTDIS7_Pos)                /**< (I2S_TXCTRL) Slot 7 Disabled for this Serializer Mask */
#define I2S_TXCTRL_SLOTDIS7(value)            (I2S_TXCTRL_SLOTDIS7_Msk & ((value) << I2S_TXCTRL_SLOTDIS7_Pos))
#define I2S_TXCTRL_MONO_Pos                   _U_(24)                                              /**< (I2S_TXCTRL) Mono Mode Position */
#define I2S_TXCTRL_MONO_Msk                   (_U_(0x1) << I2S_TXCTRL_MONO_Pos)                    /**< (I2S_TXCTRL) Mono Mode Mask */
#define I2S_TXCTRL_MONO(value)                (I2S_TXCTRL_MONO_Msk & ((value) << I2S_TXCTRL_MONO_Pos))
#define   I2S_TXCTRL_MONO_STEREO_Val          _U_(0x0)                                             /**< (I2S_TXCTRL) Normal mode  */
#define   I2S_TXCTRL_MONO_MONO_Val            _U_(0x1)                                             /**< (I2S_TXCTRL) Left channel data is duplicated to right channel  */
#define I2S_TXCTRL_MONO_STEREO                (I2S_TXCTRL_MONO_STEREO_Val << I2S_TXCTRL_MONO_Pos)  /**< (I2S_TXCTRL) Normal mode Position  */
#define I2S_TXCTRL_MONO_MONO                  (I2S_TXCTRL_MONO_MONO_Val << I2S_TXCTRL_MONO_Pos)    /**< (I2S_TXCTRL) Left channel data is duplicated to right channel Position  */
#define I2S_TXCTRL_DMA_Pos                    _U_(25)                                              /**< (I2S_TXCTRL) Single or Multiple DMA Channels Position */
#define I2S_TXCTRL_DMA_Msk                    (_U_(0x1) << I2S_TXCTRL_DMA_Pos)                     /**< (I2S_TXCTRL) Single or Multiple DMA Channels Mask */
#define I2S_TXCTRL_DMA(value)                 (I2S_TXCTRL_DMA_Msk & ((value) << I2S_TXCTRL_DMA_Pos))
#define   I2S_TXCTRL_DMA_SINGLE_Val           _U_(0x0)                                             /**< (I2S_TXCTRL) Single DMA channel  */
#define   I2S_TXCTRL_DMA_MULTIPLE_Val         _U_(0x1)                                             /**< (I2S_TXCTRL) One DMA channel per data channel  */
#define I2S_TXCTRL_DMA_SINGLE                 (I2S_TXCTRL_DMA_SINGLE_Val << I2S_TXCTRL_DMA_Pos)    /**< (I2S_TXCTRL) Single DMA channel Position  */
#define I2S_TXCTRL_DMA_MULTIPLE               (I2S_TXCTRL_DMA_MULTIPLE_Val << I2S_TXCTRL_DMA_Pos)  /**< (I2S_TXCTRL) One DMA channel per data channel Position  */
#define I2S_TXCTRL_Msk                        _U_(0x03FFF79C)                                      /**< (I2S_TXCTRL) Register Mask  */

#define I2S_TXCTRL_SLOTDIS_Pos                _U_(16)                                              /**< (I2S_TXCTRL Position) Slot x Disabled for this Serializer */
#define I2S_TXCTRL_SLOTDIS_Msk                (_U_(0xFF) << I2S_TXCTRL_SLOTDIS_Pos)                /**< (I2S_TXCTRL Mask) SLOTDIS */
#define I2S_TXCTRL_SLOTDIS(value)             (I2S_TXCTRL_SLOTDIS_Msk & ((value) << I2S_TXCTRL_SLOTDIS_Pos)) 

/* -------- I2S_RXCTRL : (I2S Offset: 0x24) (R/W 32) Rx Serializer Control -------- */
#define I2S_RXCTRL_RESETVALUE                 _U_(0x00)                                            /**<  (I2S_RXCTRL) Rx Serializer Control  Reset Value */

